package chap9.visitor;

/**

 访问者(Visitor)模式

        指将数据结构和对数据的操作分离开来，使其在不改变数据结构的前提下动态添加作用于这些元素上的操作。
        它将数据结构的定义和数据操作的定义分离开来，符合“单一职责”原则。
        通过定义不同的访问者实现对数据的不同操作，因此在需要给数据添加新的操作时只需为其定义一个新的访问者即可。

    是一种对象行为型模式，主要特点是将数据结构和用于结构上的操作解耦，使得集合的操作可自由地演化而不影响其数据结构。
    它适用于数据结构稳定但是数据操作方式多变的系统中。

    访问者模式实现的关键是将作用于元素的操作分离出来封装成独立的类，包含以下重要角色：
            抽象访问者(Visitor): 定义了一个访问元素的接口，为每类元素都定义了一个访问操作visit()，该操作中的参数类型对应被访问元素的数据类型
            具体访问者(ConcreteVisitor): v抽象访问者的实现类，实现了不同访问者访问到元素后具体的操作行为。
            抽象元素(Element): 元素的抽象表示，定义了访问该元素的入口的accept()方法，不同的访问者类型代表不同的访问者。
            具体元素(Concrete Element):  实现抽象元素定义的accept()操作，并根据访问者的不同类型实现不同的业务逻辑。


 *
 * */