package chap9.prototype;

/**
 *
    原型模式值通过调用原型实例的Clone方法或其他手段来创建对象
    原型模式属于创建型设计模式，它以当前对象为原型(蓝本)来创建另一个新的对象，而无须知道创建的细节。
    原型模式在Java中通常使用Clone技术实现，在JavaScript中通常使用对象的原型属性实现。

    原型模式的Java实现很简单，只需原型类实现Cloneable接口并覆写clone方法即可。

    Java中的复制分为浅复制和深复制：
        浅复制： Java中的浅复制是通过实现Cloneable接口并覆写Clone方法实现的。在浅复制的过程中，对象的基本数据类型的变量值会重新复制和创建，
                而引用数据类型仍指向原对象的引用。也就是说，浅复制不复制对象的引用类型数据。
        深复制： 在深复制的过程中，不论是基本数据类型还是引用数据类型，都会被重新复制和创建。简而言之，深复制彻底复制了对象的数据(包括基本数据类型和引用数据类型)，
                而浅复制的复制却并不彻底(忽略了引用数据类型)。




 *
 *
 * */