package chap9.mediator;

/**
 *
 中介者(Mediator)模式
    指对象和对象之间不直接交互，而是通过一个名为中介者的角色来实现对象之间的交互，使原有对象之间的关系变得松散，
    且可以通过定义不同的中介者来改变它们之间的交互。

    中介者模式又叫调停模式，是迪米特法则的典型应用。
    属于对象行为型模式，其主要特点是将对象与对象之间的关系变为对象和中介者之间的关系，降低了对象之间的耦合性，提高了对象功能的复用性和系统的灵活性。
    使得系统易于维护和扩展。


    主要角色：
        抽象中介者(Mediator)： 中介者接口，定义了注册同事对象方法和转发同事对象信息的方法。
        具体中介者(Concrete Mediator)： 中介者接口的实现类，定义了一个List来保存同事对象，协调各个同事角色之间的交互关系。
        抽象同事类(Colleague)： 定义同事类的接口，持有中介者对象，并定义同事对象交互的抽象方法，同时实现同事类的公共方法和功能。
        具体同事类(Concrete Colleague)： 抽象同事类的实现者，在需要与其他同事对象交互时，通过中介者对象来完成。


 *
 *
 * */